CSI API ETABS v1
cAutoSeismic.SetASCE716_1 Method
 Defines auto seismic loading parameters for the 2016 ASCE 7 code
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetASCE716_1(
	string Name,
	ref bool[] nDir,
	double Eccen,
	int PeriodFlag,
	int CtType,
	double UserT,
	bool UserZ,
	double TopZ,
	double BottomZ,
	double R,
	double Omega,
	double Cd,
	double I,
	double Ss,
	double S1,
	double TL,
	int SiteClass,
	double Fa,
	double Fv
)
Function SetASCE716_1 (
	Name As String,
	ByRef nDir As Boolean(),
	Eccen As Double,
	PeriodFlag As Integer,
	CtType As Integer,
	UserT As Double,
	UserZ As Boolean,
	TopZ As Double,
	BottomZ As Double,
	R As Double,
	Omega As Double,
	Cd As Double,
	I As Double,
	Ss As Double,
	S1 As Double,
	TL As Double,
	SiteClass As Integer,
	Fa As Double,
	Fv As Double
) As Integer
Dim instance As cAutoSeismic
Dim Name As String
Dim nDir As Boolean()
Dim Eccen As Double
Dim PeriodFlag As Integer
Dim CtType As Integer
Dim UserT As Double
Dim UserZ As Boolean
Dim TopZ As Double
Dim BottomZ As Double
Dim R As Double
Dim Omega As Double
Dim Cd As Double
Dim I As Double
Dim Ss As Double
Dim S1 As Double
Dim TL As Double
Dim SiteClass As Integer
Dim Fa As Double
Dim Fv As Double
Dim returnValue As Integer
returnValue = instance.SetASCE716_1(Name,
	nDir, Eccen, PeriodFlag, CtType, UserT,
	UserZ, TopZ, BottomZ, R, Omega, Cd,
	I, Ss, S1, TL, SiteClass, Fa, Fv)
int SetASCE716_1(
	String^ Name,
	array<bool>^% nDir,
	double Eccen,
	int PeriodFlag,
	int CtType,
	double UserT,
	bool UserZ,
	double TopZ,
	double BottomZ,
	double R,
	double Omega,
	double Cd,
	double I,
	double Ss,
	double S1,
	double TL,
	int SiteClass,
	double Fa,
	double Fv
)
abstract SetASCE716_1 :
        Name : string *
        nDir : bool[] byref *
        Eccen : float *
        PeriodFlag : int *
        CtType : int *
        UserT : float *
        UserZ : bool *
        TopZ : float *
        BottomZ : float *
        R : float *
        Omega : float *
        Cd : float *
        I : float *
        Ss : float *
        S1 : float *
        TL : float *
        SiteClass : int *
        Fa : float *
        Fv : float -> int
Parameters
Name
Type: System.String
 The name of an existing Seismic-type load pattern
nDir
Type: System.Boolean[]
 This is an array with 6 inputs that indicates the seismic load directions
nDir(0) = True = X Dir
nDir(1) = True = Y Dir
nDir(2) = True = X Dir + Eccentricity
nDir(3) = True = Y Dir + Eccentricity
nDir(4) = True = X Dir - Eccentricity
nDir(5) = True = Y Dir - Eccentricity
Eccen
Type: System.Double
 The eccentricity ratio that applies to all diaphragms
PeriodFlag
Type: System.Int32
 This is 1, 2 or 3, indicating the time period option
Approximate
Program calculated
User defined
CtType
Type: System.Int32
 This is one of the following values. This item is used only when PeriodFlag is 1 or 2
0 = Ct = 0.028 (ft), x = 0.8
1 = Ct = 0.016 (ft), x = 0.9
2 = Ct = 0.03 (ft), x = 0.75
3 = Ct = 0.02 (ft), x = 0.75
UserT
Type: System.Double
 The user specified time period. This item is meaningful when the PeriodFlag item is 3. [s]
UserZ
Type: System.Boolean
 This item is not used in ETABS
TopZ
Type: System.Double
 The global Z-coordinate at the highest level where auto seismic loads are applied. [L]
BottomZ
Type: System.Double
 The global Z-coordinate at the lowest level where auto seismic loads are applied. [L]
R
Type: System.Double
 The response modification factor
Omega
Type: System.Double
 The system overstrength factor
Cd
Type: System.Double
 The deflection amplification factor
I
Type: System.Double
 The occupancy importance factor
Ss
Type: System.Double
 The seismic coefficients Ss
S1
Type: System.Double
 The seismic coefficients S1
TL
Type: System.Double
 The long-period transition period. [s]
SiteClass
Type: System.Int32
 This is 1, 2, 3, 4, 5 or 6, indicating the site class
A
B
C
D
E
F
Fa
Type: System.Double
 The site coefficients Fa. This item is used only when the SiteClass item is 5 or 6
Fv
Type: System.Double
 The site coefficients Fv. This item is used only when the SiteClass item is 5 or 6
Return Value
Type: Int32
 returns zero if the function is successfully retrieved; otherwise it returns a nonzero value
Remarks
Examples
Public Sub Example()
   'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
   ret = EtabsObject.ApplicationStart()
   'create SapModel object
   SapModel = EtabsObject.SapModel
   'initialize model
   ret = SapModel.InitializeNewModel()
   'create steel deck template model
   ret = mySapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
   'add new load pattern
   ret = mySapModel.LoadPatterns.Add("EQX", eLoadPatternType.Quake)
   'assign ASCE716 parameters
   Dim nDir() As Boolean
   Dim Eccen As Double
   Dim PeriodFlag As Long
   Dim CtType As Long
   Dim UserT As Double
   Dim UserZ As Boolean
   Dim TopZ As Double
   Dim BottomZ As Double
   Dim R As Double
   Dim Omega As Double
   Dim Cd As Double
   Dim I As Double
   Dim SS As Double
   Dim S1 As Double
   Dim TL As Double
   Dim SiteClass As Long
   Dim Fa As Double
   Dim Fv As Double
   ReDim nDir(6)
   nDir(1) = True
   nDir(2) = False
   nDir(3) = True
   nDir(4) = False
   nDir(5) = True
   nDir(6) = True
   TopZ = 32
   BottomZ = 14
   'set ASCE716 parameters
   ret = mySapModel.LoadPatterns.AutoSeismic.SetASCE716_1("EQX", nDir, 0.04, 3, 1, 1.76, False, TopZ, BottomZ, 6, 3.5, 6.5, 1.5, 1.9, 1.1, 8, 3, 0, 0)
   'get ASCE716 parameters
   ret = mySapModel.LoadPatterns.AutoSeismic.GetASCE716_1("EQX", nDir, Eccen, PeriodFlag, CtType, UserT, UserZ, TopZ, BottomZ, R, Omega, Cd, I, SS, S1, TL, SiteClass, Fa, Fv)
   'close ETABS
   EtabsObject.ApplicationExit(False)
   'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
   End Sub
See Also
Reference
cAutoSeismic Interface
ETABSv1 Namespace